app/controllers/admin/dashboard_controller.rb

  def index
  @projects_with_allocations = Project
  .left_joins(:allocations)
  .group('projects.id')
  .select('projects.*, COALESCE(SUM(allocations.amount), 0) as total_allocated')
---
SELECT COUNT(projects.*, COALESCE(SUM(allocations.amount), 0) as total_allocated) AS "count_projects_all_coalesce_sum_allocations_amount_0_as_total_a", "projects"."id" AS "projects_id" FROM "projects" LEFT OUTER JOIN "allocations" ON "allocations"."project_id" = "projects"."id" GROUP BY "projects"."id"
SELECT projects.*, COALESCE(SUM(allocations.amount), 0) as total_allocated FROM "projects" LEFT OUTER JOIN "allocations" ON "allocations"."project_id" = "projects"."id" GROUP BY "projects"."id"