app/views/home/index.html.erb


            inputs.forEach((input) => {
                const value = parseInt(input.value) || 0;
                const requestedAmount = parseInt(input.dataset.requested);
                const projectId = input.id.split('_')[1];

                totalAllocated += value;

                // Update input styling and warnings
                const card = input.closest('.project-card');
                const progressFill = input.parentElement.querySelector('.progress-fill');
                const warningElement = document.getElementById(`warning_${projectId}`);

                // Check if allocation exceeds requested amount
                const isOverRequested = value > requestedAmount;
                if (isOverRequested) {
                    hasOverAllocation = true;
                    input.classList.add('over-requested');
                    card.classList.add('over-requested');
                    progressFill.classList.add('over-requested');
                    warningElement.style.display = 'block';
                } else {
---
SELECT "projects".* FROM "projects"