app/controllers/allocations_controller.rb

DELETE FROM "allocations" WHERE "allocations"."id" = 1
INSERT INTO "allocations" ("user_id", "project_id", "amount", "created_at", "updated_at") VALUES (2, 1, 600, '2025-07-12 10:26:42.528982', '2025-07-12 10:26:42.528982') RETURNING "id"
---
  def create
    ActiveRecord::Base.transaction do
      current_user.allocations.destroy_all

      params[:allocations].each do |project_id, amount|
        next if amount.to_i <= 0

        current_user.allocations.create!(
          project_id: project_id,
          amount: amount.to_i
        )