app/controllers/home_controller.rb

  def index
    @projects = Project.all
    @allocations = current_user.allocations.index_by(&:project_id)
    @remaining = 1000 - @allocations.values.sum(&:amount)
---
SELECT "projects".* FROM "projects"
SELECT "allocations".* FROM "allocations" WHERE "allocations"."user_id" = 1