app/models/allocation.rb

  def within_user_budget
    return unless user && amount

    # Calculate total including this allocation
    total = user.allocations.where.not(id: id).sum(:amount) + amount.to_i
---
SELECT SUM("allocations"."amount") FROM "allocations" WHERE "allocations"."user_id" = 3 AND "allocations"."id" IS NOT NULL